#pragma once

#include "TES3Defines.h"

#include "TES3Vectors.h"

namespace TES3 {
	enum AttackAnimationState : signed char {
		Idle = 0x0,
		Ready = 0x1,
		SwingUp = 0x2,
		SwingDown = 0x3,
		SwingHit = 0x4,
		SwingFollowLight = 0x5,
		SwingFollowMed = 0x6,
		SwingFollowHeavy = 0x7,
		ReadyingWeap = 0x8,
		UnreadyWeap = 0x9,
		Casting = 0xA,
		CastingFollow = 0xB,
		ReadyingMagic = 0xC,
		UnreadyMagic = 0xD,
		Knockdown = 0xE,
		KnockedOut = 0xF,
		PickingProbing = 0x10,
		Unknown_0x11 = 0x11,
		Dying = 0x12,
		Dead = 0x13,
	};

	enum class PhysicalAttackType : unsigned char {
		None = 0,
		Slash = 1,
		Chop = 2,
		Thrust = 3,
		Projectile = 4,
		Creature1 = 5,
		Creature2 = 6,
		Creature3 = 7
	};

	struct ActionData {
		short unknown_0x0;
		short unknown_0x2;
		float attackSwing; // 0x4
		float swingTimer; // 0x8
		float physicalDamage; // 0xC
		signed char aiBehaviourState; // 0x10
		AttackAnimationState animStateAttack; // 0x11
		char blockingState; // 0x12
		unsigned char maybe_animGroupKnockdown; // 0x13
		PhysicalAttackType physicalAttackType; // 0x14
		unsigned char currentAnimLayer; // 0x15
		unsigned char currentAnimGroup; // 0x16
		unsigned char animGroupShieldArm; // 0x17
		short unknown_0x18;
		short unknown_0x1A;
		short unknown_0x1C;
		short unknown_0x1E;
		MobileActor * target; // 0x20
		MobileActor * hitTarget; // 0x24
		short lastBarterHoursPassed; // 0x28
		short unknown_0x2A;
		BaseObject * stolenFromFactionOrNPC; // 0x2C
		bool attackWasBlocked; // 0x30
		char padding_0x31[3];
		MobileProjectile * nockedProjectile; // 0x34
		short countAIPackages; // 0x38
		Vector3 unknown_0x3C;
		Vector3 unknown_0x48;
		Vector3 unknown_0x54;
		Vector3 walkDestination; // 0x58
		int unknown_0x6C;

	};
	static_assert(sizeof(ActionData) == 0x70, "TES3::ActionData failed size validation");
}
