#include "DialogRenderWindow.h"

#include "LogUtil.h"
#include "MathUtil.h"
#include "MemoryUtil.h"
#include "WindowsUtil.h"

#include "NIBound.h"
#include "NICamera.h"
#include "NILight.h"
#include "NINode.h"
#include "NIPick.h"

#include "CSCell.h"
#include "CSDataHandler.h"
#include "CSGameFile.h"
#include "CSLandTexture.h"
#include "CSLight.h"
#include "CSRecordHandler.h"
#include "CSReference.h"
#include "CSStatic.h"

#include "Settings.h"

namespace se::cs::dialog::render_window {
	using namespace windows;

	static WORD lastRenderWindowPosX = 0;
	static WORD lastRenderWindowPosY = 0;

	//
	// Patch: Use world rotation values unless ALT is held.
	//

	using gObjectMove = memory::ExternalGlobal<float, 0x6CE9B0>;
	using gSnapAngleInDegrees = memory::ExternalGlobal<int, 0x6CE9AC>;
	using gRotationFlags = memory::ExternalGlobal<BYTE, 0x6CE9A4>;
	using gCumulativeRotationValues = memory::ExternalGlobal<NI::Vector3, 0x6CF760>;
	using gRenderWindowPick = memory::ExternalGlobal<NI::Pick, 0x6CF528>;
	using gCurrentCell = memory::ExternalGlobal<Cell*, 0x6CF7B8>;

	// TODO: Move to real definition file.
	struct TranslationData {
		enum class RotationAxis : unsigned int {
			X = 1,
			Z = 2,
			Y = 3,
		};
		struct Target {
			Reference* reference; // 0x0
			Target* previous; // 0x4
			Target* next; // 0x8
		};
		Target* firstTarget; // 0x0
		unsigned int numberOfTargets; // 0x4
		NI::Bound bound; // 0x8

		static inline auto get() {
			return memory::ExternalGlobal<TranslationData*, 0x6CE968>::get();
		}
	};

	struct NetImmerseInstance {
		struct VirtualTable {
			void* dtor; // 0x0
			void* setRegistryKey; // 0x4
			void* setWindowWidth; // 0x8
			void* setWindowHeight; // 0xC
			void* setBitDepth; // 0x10
			void* setBackBuffers; // 0x14
			void* setMultisampleEnable; // 0x18
			void* setMultisamples; // 0x1C
			void* setFullScreen; // 0x20
			void(__thiscall* setPixelShaderEnabled)(NetImmerseInstance*, bool); // 0x24
			void* setStencil; // 0x28
			void* setMipmap; // 0x2C
			void* setMipmapSkipLevel; // 0x30
			void* setHardwareTL; // 0x34
			void* setMultipass; // 0x38
			void* setVertexProcessing; // 0x3C
			void* setSwapEffect; // 0x40
			void* setRefreshRate; // 0x44
			void* setPresentInterval; // 0x48
			void* setAdapterID; // 0x4C
			void(__thiscall* setGamma)(NetImmerseInstance*, float); // 0x50
			void* readSettings; // 0x54
			void* writeSettings; // 0x58
			void* createRenderer; // 0x5C
			void* createRendererFromSettings; // 0x60
		};
		VirtualTable* vTable; // 0x0
		const char* ownerString; // 0x4
		int windowWidth; // 0x8
		int windowHeight; // 0xC
		int screenDepth; // 0x10
		int backBuffers; // 0x14
		int multiSamples; // 0x18
		bool fullscreen; // 0x1C
		bool stencil; // 0x1D
		bool mipmap; // 0x1E
		bool hardware; // 0x1F
		bool pixelShader; // 0x20
		bool multiPass; // 0x21
		bool screenShotsEnabled; // 0x22
		int vertexProcessing; // 0x24
		int swapEffect; // 0x28
		int refreshRate; // 0x2C
		int adapter; // 0x30
		int mipmapSkipLevel; // 0x34
		int presentationInterval; // 0x38
		float gamma; // 0x3C
		NI::Vector3 unknown_0x40;
		NI::Node* node; // 0x4C
		NI::Renderer* renderer; // 0x50
		int unknown_0x54;
		HWND parentWindow; // 0x58
		int unknown_0x5C;
		int unknown_0x60;
	};
	static_assert(sizeof(NetImmerseInstance) == 0x64, "CS::NetImmerseInstance failed size validation");
	static_assert(sizeof(NetImmerseInstance::VirtualTable) == 0x64, "CS::NetImmerseInstance's virtual table failed size validation");

	struct SceneGraphController {
		NI::Node* sceneRoot;
		NI::Node* objectRoot;
		NI::Node* landscapeRoot;
		NI::ZBufferProperty* zBufferProperty;
		NI::Property* wireframeProperty;
		int unknown_0x14;
		int unknown_0x18;
		int unknown_0x1C;
		int unknown_0x20;

		static inline auto get() {
			return memory::ExternalGlobal<SceneGraphController*, 0x6CEB78>::get();
		}
	};
	static_assert(sizeof(SceneGraphController) == 0x24, "CS::SceneGraphController failed size validation");

	const auto TES3_CS_OriginalRotationLogic = reinterpret_cast<bool(__cdecl*)(void*, TranslationData::Target*, int, TranslationData::RotationAxis)>(0x4652D0);
