// dllmain.cpp : Defines the entry point for the DLL application.

#include "TES3IteratedList.h"

static std::ofstream logstream;
static unsigned int patchCount = 0;

template <class T>
class MemAccess {
public:
	static inline T Get(uintptr_t address) {
		return *reinterpret_cast<T*>(address);
	}

	static inline void Set(uintptr_t address, T value) {
		*reinterpret_cast<T*>(address) = value;
	}
};

void genNOP(DWORD Address) {
	MemAccess<unsigned char>::Set(Address, 0x90);
}

bool genCallEnforced(DWORD address, DWORD previousTo, DWORD to, DWORD size = 0x5) {
	// Make sure we're doing a call.
	BYTE instruction = *reinterpret_cast<BYTE*>(address);
	if (instruction != 0xE8) {
#if _DEBUG
		logstream << "[MemoryUtil] Skipping call generation at 0x" << std::hex << address << ". Expected 0xe8, found instruction: 0x" << (int)instruction << "." << std::endl;
#endif
		return false;
	}

	// Read previous call address to make sure it's what we are expecting.
	DWORD currentCallAddress = *reinterpret_cast<DWORD*>(address + 1) + address + 0x5;
	if (currentCallAddress != previousTo) {
#if _DEBUG
		logstream << "[MemoryUtil] Skipping call generation at 0x" << std::hex << address << ". Expected previous call to 0x" << previousTo << ", found 0x" << currentCallAddress << "." << std::endl;
#endif
		return false;
	}

	// Unprotect memory.
	DWORD oldProtect;
	VirtualProtect((DWORD*)address, size, PAGE_READWRITE, &oldProtect);

	// Create our call.
	MemAccess<unsigned char>::Set(address, 0xE8);
	MemAccess<DWORD>::Set(address + 1, to - address - 0x5);

	// NOP out the rest of the block.
	for (DWORD i = address + 5; i < address + size; ++i) {
		genNOP(i);
	}

	// Protect memory again.
	VirtualProtect((DWORD*)address, size, oldProtect, &oldProtect);

	++patchCount;
	return true;
}

bool genJumpEnforced(DWORD address, DWORD previousTo, DWORD to, DWORD size = 0x5) {
	// Make sure we're doing a jump.
	BYTE instruction = *reinterpret_cast<BYTE*>(address);
	if (instruction != 0xE9) {
#if _DEBUG
		logstream << "[MemoryUtil] Skipping jump generation at 0x" << std::hex << address << ". Expected 0xe9, found instruction: 0x" << (int)instruction << "." << std::endl;
#endif
		return false;
	}

	// Read previous jump address to make sure it's what we are expecting.
	DWORD currentCallAddress = *reinterpret_cast<DWORD*>(address + 1) + address + 0x5;
	if (currentCallAddress != previousTo) {
#if _DEBUG
		logstream << "[MemoryUtil] Skipping jump generation at 0x" << std::hex << address << ". Expected previous jump to 0x" << previousTo << ", found 0x" << currentCallAddress << "." << std::endl;
#endif
		return false;
	}

	// Unprotect memory.
	DWORD oldProtect;
	VirtualProtect((DWORD*)address, size, PAGE_READWRITE, &oldProtect);

	// Create our jump.
	MemAccess<unsigned char>::Set(address, 0xE9);
	MemAccess<DWORD>::Set(address + 1, to - address - 0x5);

	// NOP out the rest of the block.
	for (DWORD i = address + 5; i < address + size; ++i) {
		genNOP(i);
	}

	// Protect memory again.
	VirtualProtect((DWORD*)address, size, oldProtect, &oldProtect);

	++patchCount;
	return true;
}

bool writeDoubleWordEnforced(DWORD address, DWORD previousValue, DWORD value) {
	DWORD currentValue = *reinterpret_cast<DWORD*>(address);
	if (currentValue != previousValue) {
#ifdef _DEBUG
		logstream << "[MemoryUtil] Skipping write double word at 0x" << std::hex << address << ". Expected previous value of 0x" << previousValue << ", found 0x" << currentValue << "." << std::endl;
#endif
		return false;
	}

	// Unprotect memory.
	DWORD oldProtect;
	VirtualProtect((DWORD*)address, sizeof(DWORD), PAGE_READWRITE, &oldProtect);

	// Overwrite our single byte.
	MemAccess<DWORD>::Set(address, value);

	// Protect memory again.
	VirtualProtect((DWORD*)address, sizeof(DWORD), oldProtect, &oldProtect);

	return true;
}

namespace NI {
	struct Node;
	struct Renderer;

	struct Vector3 {
		float x, y, z;

		Vector3() : x(0.0f), y(0.0f), z(0.0f) {}
		Vector3(float _x, float _y, float _z) : x(_x), y(_y), z(_z) {}

		Vector3 operator+(const Vector3& vec3) const {
			return Vector3(x + vec3.x, y + vec3.y, z + vec3.z);
		}

		Vector3 operator-(const Vector3& vec3) const {
			return Vector3(x - vec3.x, y - vec3.y, z - vec3.z);
		}

		friend std::ostream& operator<<(std::ostream& str, const Vector3& vector) {
			str << "(" << vector.x << "," << vector.y << "," << vector.z << ")";
			return str;
		}
	};

	struct Vector4 {
		float x, y, z, w;
	};

	struct Matrix33 {
		Vector3 m0, m1, m2;

		friend std::ostream& operator<<(std::ostream& str, const Matrix33& matrix) {
			str << "[" << matrix.m0 << "," << matrix.m1 << "," << matrix.m2 << "]";
			return str;
		}

		static constexpr auto _multiplyValueMatrix = reinterpret_cast<Matrix33 * (__thiscall*)(Matrix33*, Matrix33*, Matrix33*)>(0x5E2060);
		Matrix33* multiplyValue(Matrix33* out_result, Matrix33* value) {
			return _multiplyValueMatrix(this, out_result, value);
		}

		Matrix33 multiplyValue(Matrix33* value) {
			Matrix33 result;
			multiplyValue(&result, value);
			return result;
		}

		static constexpr auto _multiplyValueVec3 = reinterpret_cast<Vector3 * (__thiscall*)(Matrix33*, Vector3*, Vector3*)>(0x5E21F0);
		Vector3* multiplyValue(Vector3* out_result, Vector3* value) {
			return _multiplyValueVec3(this, out_result, value);
		}

		Vector3 multiplyValue(Vector3* value) {
			Vector3 result;
			multiplyValue(&result, value);
			return result;
		}

		static constexpr auto _toRotationX = reinterpret_cast<void(__thiscall*)(Matrix33*, float)>(0x5E1CC0);
		void toRotationX(float value) {
			_toRotationX(this, value);
		}

		static constexpr auto _toRotationY = reinterpret_cast<void(__thiscall*)(Matrix33*, float)>(0x5E1D00);
		void toRotationY(float value) {
			_toRotationY(this, value);
		}

		static constexpr auto _toRotationZ = reinterpret_cast<void(__thiscall*)(Matrix33*, float)>(0x5E1D40);
		void toRotationZ(float value) {
			_toRotationZ(this, value);
		}

		bool isIdentityMatrix() const {
			return this == getIdentityMatrix();
		}

		void toIdentity() {
			*this = *getIdentityMatrix();
		}

		static Matrix33* getIdentityMatrix() {
			return reinterpret_cast<Matrix33*>(0x6D7BDC);
		}

		static Matrix33 fromEulerXYZ(float x, float y, float z) {
			float cx = cos(x);
			float sx = sin(x);
			float cy = cos(y);
			float sy = sin(y);
			float cz = cos(z);
			float sz = sin(z);

			Matrix33 m;
			m.m0.x = cy * cz;
			m.m0.y = cy * sz;
			m.m0.z = -sy;
			m.m1.x = sx * sy * cz - cx * sz;
			m.m1.y = sx * sy * sz + cx * cz;
			m.m1.z = sx * cy;
			m.m2.x = cx * sy * cz + sx * sz;
			m.m2.y = cx * sy * sz - sx * cz;
			m.m2.z = cx * cy;

			return m;
		}

		Vector3 toEulerXYZ() {
			float x = 0.0;
			float y = 0.0;
			float z = 0.0;

			y = asin(-this->m0.z);
			if (cos(y) != 0) {
				x = atan2(this->m1.z, this->m2.z);
				z = atan2(this->m0.y, this->m0.x);
			}
			else {
				x = atan2(this->m2.x, this->m2.y);
				z = 0;
			};

			NI::Vector3 out;
			out.x = x;
			out.y = y;
			out.z = z;

			return out;
		}
	};

	struct Matrix44 {
		Vector4 m0, m1, m2, m3;
	};

	struct Transform {
		Matrix33 rotation;
		Vector3 position;
		float scale;
	};

	struct RTTI {
		const char* name; // 0x0
		RTTI* parent; // 0x4
	};

	struct Object {
		struct VirtualTable {
			void(__thiscall* destructor)(Object*, int); // 0x0
			RTTI* (__thiscall* getRTTI)(const Object*); // 0x4
		};
		VirtualTable* vtbl; // 0x0
		unsigned int refCount; // 0x4

		RTTI* getRTTI() const {
			return vtbl->getRTTI(this);
		}
	};

	struct ObjectNET : Object {
		char* name; // 0x8
		void* extraData; // 0xC
		void* controllers; // 0x10
	};

	template <typename T>
	struct LinkedList {
		T* data;
		LinkedList<T>* next;
	};
	static_assert(sizeof(LinkedList<void>) == 0x8, "NI::LinkedList failed size validation");

	struct AVObject : ObjectNET {
		unsigned short flags; // 0x14
		short pad_16;
		Node* parentNode; // 0x18
		Vector3 worldBoundOrigin; // 0x1C
		float worldBoundRadius; // 0x28
		Matrix33* localRotation; // 0x2C
		Vector3 localTranslate; // 0x30
		float localScale; // 0x3C
		Transform worldTransform; // 0x40
		void* velocities; // 0x74
		void* modelABV; // 0x78
		void* worldABV; // 0x7C
		int(__cdecl* collideCallback)(void*); // 0x80
		void* collideCallbackUserData; // 0x84
		LinkedList<void> propertyNode; // 0x88
	};

	struct Frustum {
		float left; // 0x0
		float right; // 0x4
		float top; // 0x8
		float bottom; // 0xC
		float near; // 0x10
		float far; // 0x14
	};

	template <typename T>
	struct TArray {
		void* vtbl;
		T* storage; // 0x4
		size_t storageCount; // 0x8 // # of slots in the array.
		size_t endIndex; // 0xC // First empty slot in the array.
		size_t filledCount; // 0x10 // Number of filled slots.
		size_t growByCount; // 0x14 // Number of slots to increase storage by.
	};

	struct Camera : AVObject {
		Matrix44 worldToCamera; // 0x90
		float viewDistance; // 0xD0
		float twoDivRmL; // 0xD4
		float twoDivTmB; // 0xD8
		Vector3 worldDirection; // 0xDC
		Vector3 worldUp; // 0xE8
		Vector3 worldRight; // 0xF4
		Frustum viewFrustum; // 0x100
		Vector4 port; // 0x118
		Node* scene; // 0x128
		TArray<void*> unknown_0x12C; // Screen related?
		Renderer* renderer; // 0x144
		TArray<void*> unknown_0x148; // Multiple cameras?
		int unknown_0x160;
		Vector4 cullingPlanes[6]; // 0x164
		float unknown_0x1C4;
		float unknown_0x1C8;
		float unknown_0x1CC;
		float unknown_0x1D0;
		void* unknown_0x1D4;
		int unknown_0x1D8;
		float LODAdjust; // 0x1DC
	};
	static_assert(sizeof(Camera) == 0x1E0, "NI::Camera failed size validation");
}

namespace TES3 {
	namespace ObjectType {
		enum ObjectType {
			Invalid = 0,
			Activator = 'ITCA',
			Alchemy = 'HCLA',
			Ammo = 'OMMA',
			AnimationGroup = 'GINA',
			Apparatus = 'APPA',
			Armor = 'OMRA',
			Birthsign = 'NGSB',
			Bodypart = 'YDOB',
			Book = 'KOOB',
			Cell = 'LLEC',
			Class = 'SALC',
			Clothing = 'TOLC',
			Container = 'TNOC',
			Creature = 'AERC',
			CreatureClone = 'CERC',
			Dialogue = 'LAID',
			DialogueInfo = 'OFNI',
			Door = 'ROOD',
			Enchantment = 'HCNE',
			Faction = 'TCAF',
			GameSetting = 'TSMG',
			Global = 'BOLG',
			Ingredient = 'RGNI',
			Land = 'DNAL',
			LandTexture = 'XETL',
			LeveledCreature = 'CVEL',
			LeveledItem = 'IVEL',
			Light = 'HGIL',
			Lockpick = 'KCOL',
			MagicEffect = 'FEGM',
			MagicSourceInstance = 'LLPS',
			Misc = 'CSIM',
			MobileCreature = 'RCAM',
			MobileNPC = 'HCAM',
			MobileObject = 'TCAM',
			MobilePlayer = 'PCAM',
			MobileProjectile = 'JRPM',
			MobileSpellProjectile = 'PSPM',
			NPC = '_CPN',
			NPCClone = 'CCPN',
			PathGrid = 'DRGP',
			Probe = 'BORP',
			Quest = 'SEUQ',
			Race = 'ECAR',
			Reference = 'RFER',
			Region = 'NGER',
			Repair = 'APER',
			Script = 'TPCS',
			Skill = 'LIKS',
			Sound = 'NUOS',
			SoundGenerator = 'GDNS',
			Spell = 'LEPS',
			Static = 'TATS',
			TES3 = '3SET',
			Weapon = 'PAEW',
		};
	}

	struct GameFile {
		unsigned int unknown_0x0;
		unsigned int unknown_0x4;
		unsigned int unknown_0x8;
		char fileName[260];
		char filePath[260];
	};

	struct BaseObject {
		void* vtbl; // 0x0
		ObjectType::ObjectType objectType; // 0x4
		unsigned int flags; // 0x8
		GameFile* sourceFile; // 0xC
	};
	static_assert(sizeof(BaseObject) == 0x10, "TES3::BaseObject failed size validation");

	struct DialogueInfo : BaseObject {
		struct LoadLinkNode {
			const char* name; // 0x0
			const char* previous; // 0x4
			const char* next; // 0x8
		};
		LoadLinkNode* loadLinkNodes; // 0x10
		int unknown_0x14;
		int unknown_0x18;
		unsigned char npcRank; // 0x1C
		unsigned char npcSex; // 0x1D
		unsigned char pcRank; // 0x1E
		unsigned char unknown_0x1F;
		char unknown_0x20[60];
		int unknown_0x5C[18];
	};
	static_assert(sizeof(DialogueInfo) == 0xA4, "TES3::DialogueInfo failed size validation");

	struct Dialogue : BaseObject {
		const char* id; // 0x10
		unsigned char type; // 0x14
		IteratedList<DialogueInfo*> topics; // 0x18
	};
	static_assert(sizeof(Dialogue) == 0x2C, "TES3::Dialogue failed size validation");

	struct RecordHandler {
		int activeModCount; // 0x0
		int unknown_0x4[13];
		IteratedList<Dialogue*>* dialogues; // 0x38
		int unknown_0x3C[10975];
		GameFile* activeGameFiles[256]; // 0xABB8
		// ...
	};
	static_assert(offsetof(RecordHandler, activeGameFiles) == 0xABB8, "TES3::RecordHandler failed offset validation");

	struct ReferenceTransformationAttachment {
		NI::Vector3 orientation;
		NI::Vector3 position;
	};

	struct Reference : BaseObject {
		NI::AVObject* sceneNode; // 0x10
		int unknown_0x14;
		int unknown_0x18;
		int unknown_0x1C;
		int unknown_0x20;
		int unknown_0x24;
		BaseObject* baseObject; // 0x28
		NI::Vector3 orientationNonAttached; //0x2C
		NI::Vector3 anotherOrientation; //0x38
		NI::Vector3 yetAnotherOrientation; //0x44
		NI::Vector3 position; // 0x50
	};

	struct TranslationData {
		enum class RotationAxis : unsigned int {
			X = 1,
			Z = 2,
			Y = 3,
		};
		struct Target {
			TES3::Reference* reference; // 0x0
			Target* previous; // 0x4
			Target* next; // 0x8
		};
		Target* firstTarget; // 0x0
		unsigned int numberOfTargets; // 0x4
		NI::Vector3 position; // 0x8
		void* unknown_0x14;
	};
}

static TES3::GameFile* master_Morrowind = nullptr;
static TES3::GameFile* master_Tribunal = nullptr;
static TES3::GameFile* master_Bloodmoon = nullptr;

bool isVanillaMaster(TES3::GameFile* master) {
	return (master_Morrowind && master == master_Morrowind)
		|| (master_Tribunal && master == master_Tribunal)
		|| (master_Bloodmoon && master == master_Bloodmoon);
}

const auto TES3_RecordHandler_whoCares = reinterpret_cast<void(__thiscall*)(TES3::RecordHandler*)>(0x4041C4);
void __fastcall Patch_FindVanillaMasters(TES3::RecordHandler* recordHandler) {
	const auto constHandler = recordHandler;
	for (auto i = 0; i < constHandler->activeModCount; ++i) {
		const auto gameFile = constHandler->activeGameFiles[i];
		if (master_Morrowind == nullptr && _strnicmp(gameFile->fileName, "Morrowind.esm", 260) == 0) {
			master_Morrowind = gameFile;
		}
